app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "user"], ["email", "Josediazt6@outlook.com"], ["password", "iamsunt6"], ["created_at", "2021-01-21 22:38:20.230034"], ["updated_at", "2021-01-21 22:38:20.230034"]]
---
  def create
    @user = User.new(user_params)
    # @user = User.new(user: params[:username], email: params[:email], password: params[:password])

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:id].to_i)

UPDATE "users" SET "email" = ?, "password" = ?, "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "email0@email.com"], ["password", "Passwordd"], ["username", "User__"], ["updated_at", "2021-01-27 14:28:48.131057"], ["id", 20]]
UPDATE "users" SET "password" = ?, "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "iamsunt6"], ["username", "User_Zero"], ["updated_at", "2021-01-26 20:10:04.867108"], ["id", 0]]
---
  def update
    @user = User.update(user_params)
    if User.update(user_params)